---
kind: method
id: M:Autodesk.Revit.DB.PointNode.GetPoint
source: html/2f9cddca-b6d7-062b-4630-09a532550d9b.htm
---
# Autodesk.Revit.DB.PointNode.GetPoint Method

Returns the point object corresponding to the node.

## Syntax (C#)
```csharp
public Point GetPoint()
```

## Returns
The point instance.